ПД_sev/src/Documents/РабочееВремя/РабочееВремя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РабочееВремя</name>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.Начисления</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпенсироватьТолькоПереработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>CatalogRef.МП_ВнешниеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабельРабочегоВремени</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНачисление</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Координаты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Documents/РабочееВремя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТабельРабочегоВремениДеньНеделиПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Функция ВремяВведеноКорректноКлиент(ТекСтрока)
	ЗначениеВозврата = Истина;
	Если ТекСтрока.ВремяОкончания < ТекСтрока.ВремяНачала Тогда 
		Сообщить("Время окончания не может быть меньше времени начала!", СтатусСообщения.Важное);
		ТекСтрока.Сумма = Неопределено;
		ЗначениеВозврата = Ложь;
	КонецЕсли;
	Возврат ЗначениеВозврата;
КонецФункции

&НаСервере
Процедура РаспределитьСтрокивТабличнойЧастиПоРабочемуВремениСервер()
	ТаблицаДанных = Объект.ТабельРабочегоВремени.Выгрузить();
	УправлениеРабочимВременем.РаздробитьСтрокиКТЗНаРабочиеЧасы(ТаблицаДанных, Объект.КомпенсироватьТолькоПереработки, Объект.Дата);
	Объект.ТабельРабочегоВремени.Загрузить(ТаблицаДанных);
	//ЗначениеВРеквизитФормы(ТаблицаДанных, "Объект.ТабельРабочегоВремени");
КонецПроцедуры

&НаКлиенте
Процедура РассчетСуммыПоСтрокеКлиент()
	НачалоРабДня = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("ПерсоналНачалоРабочегоДня");
	КонецРабДня = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("ПерсоналОкончаниеРабочегоДня");
	ТекСтрока = Элементы.ТабельРабочегоВремени.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	Если Не ВремяВведеноКорректноКлиент(ТекСтрока) Тогда
		Возврат	
	КонецЕсли;
	//Если УправлениеРабочимВременем.НеобходимоРаспределитьСтрокуКлиент(ТекСтрока.ДеньНедели, ТекСтрока.ВремяНачала, ТекСтрока.ВремяОкончания) Тогда
		РаспределитьСтрокивТабличнойЧастиПоРабочемуВремениСервер();	
	//КонецЕсли;
	
	//Для Каждого СтрокаРВ ИЗ Объект.ТабельРабочегоВремени Цикл 	
	//	стрПараметры = Новый Структура;
	//	стрПараметры.Вставить("ДеньНедели", СтрокаРВ.ДеньНедели); 
	//	стрПараметры.Вставить("ВремяОкончания", СтрокаРВ.ВремяОкончания); 
	//	стрПараметры.Вставить("ВремяНачала", СтрокаРВ.ВремяНачала); 
	//	Сумма = РассчетСуммыПоСтрокеСервер(стрПараметры);
	//	СтрокаРВ.Сумма = Сумма; 
	//	Если Объект.КомпенсироватьТолькоПереработки 
	//		И Не (СтрокаРВ.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.Суббота") 
	//			ИЛИ СтрокаРВ.ДеньНедели = ПредопределенноеЗначение("Перечисление.ДниНедели.Воскресенье"))Тогда
	//		Если СтрокаРВ.ВремяНачала < НачалоРабДня ИЛИ  СтрокаРВ.ВремяОкончания > КонецРабДня Тогда
	//			СтрокаРВ.ВНачисление = Истина;
	//		Иначе
	//			СтрокаРВ.ВНачисление = Ложь;
	//		КонецЕсли;				
	//	Иначе
	//		СтрокаРВ.ВНачисление = Истина;		
	//	КонецЕсли;
	//	СтрокаРВ.Количество = (СтрокаРВ.ВремяОкончания - СтрокаРВ.ВремяНачала) / 3600; 
	//	Если СтрокаРВ.Количество = 0 Тогда 
	//		СтрокаРВ.Цена = 0;
	//	Иначе
	//		СтрокаРВ.Цена = СтрокаРВ.Сумма / СтрокаРВ.Количество;
	//	КонецЕсли;
	//КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениВремяНачалаПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениВремяОкончанияПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СуммаДокумента = Объект.ТабельРабочегоВремени.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениДатаПриИзменении(Элемент)
	ТекСтрока = Элементы.ТабельРабочегоВремени.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	ТекСтрока.ДеньНедели = УправлениеРабочимВременем.ПолучитьДеньНеделиПоДате(ТекСтрока.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	Объект.КомпенсироватьТолькоПереработки = ОбщегоНазначения.ПолучитьЗначениРеквизитаОбъекта(Объект.Сотрудник, "КомпенсироватьТолькоПереработки");
	РассчетСуммыПоСтрокеКлиент();	
КонецПроцедуры

&НаКлиенте
Процедура КомпенсироватьТолькоПереработкиПриИзменении(Элемент)
	РассчетСуммыПоСтрокеКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РаботаСФормамиКлиент.ОповеститьПослеЗаписиФормы("ЗаписьНаФорме", Объект.Ссылка, Новый Структура("Проект", Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениКоличествоПриИзменении(Элемент)
	Элементы.ТабельРабочегоВремени.ТекущиеДанные.Сумма = Элементы.ТабельРабочегоВремени.ТекущиеДанные.Цена * Элементы.ТабельРабочегоВремени.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТабельРабочегоВремениЦенаПриИзменении(Элемент)
	Элементы.ТабельРабочегоВремени.ТекущиеДанные.Сумма = Элементы.ТабельРабочегоВремени.ТекущиеДанные.Цена * Элементы.ТабельРабочегоВремени.ТекущиеДанные.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформлениеСервер();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСервер()
	Если Объект.Согласовано И Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;	
	КонецЕсли;		
КонецПроцедуры
